In [ ]:
### 외부 라이브러리 설치
!pip install pandas

In [1]:
## 라이브러리 로드
import pandas as pd

In [18]:
## 시리즈의 형태
## pd.Series()
pd_list = pd.Series(
    [5000, 5500, 6000, 6500],
    ['아메리카노','카페라떼','카페모카','카푸치노']
)
print(pd_list)

아메리카노    5000
카페라떼     5500
카페모카     6000
카푸치노     6500
dtype: int64

In [19]:
## value값과 index값을 따로 출력
print("시리즈의 value =", pd_list.values)
print("시리즈의 index =", pd_list.index)

시리즈의 value = [5000 5500 6000 6500]
시리즈의 index = Index(['아메리카노', '카페라떼', '카페모카', '카푸치노'], dtype='object')

In [21]:
pd_list.index = ["대추차","홍차","생강차","모과차"]
print("시리즈의 index =", pd_list.index)

시리즈의 index = Index(['대추차', '홍차', '생강차', '모과차'], dtype='object')

In [9]:
#데이터프레임 형태의 데이터 생성
values = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(values)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
## index 값을 변경 a,b,c
## colum 값을 변경 A,B,C

df.index = ['a','b','c']
df.columns = ["A","B","C"]
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [22]:
## e딕셔너리 형태의 데이터를 데이터프레임 형태로 변경

values = {
    "name" : ["A", "B", "C"],
    "age"  : [20, 30, 40],
    "phone": ["010-2345-6789","010-0645-4534","010-2344-5677"]
}

df_2 = pd.DataFrame(values)
df_2

  name  age          phone
0    A   20  010-2345-6789
1    B   30  010-0645-4534
2    C   40  010-2344-5677

In [23]:
## 상단의 행을 기준으로 출력하는 head()
## 상단부터 n번까지 출력하는 함수
df_2.head(2)

  name  age          phone
0    A   20  010-2345-6789
1    B   30  010-0645-4534

In [24]:
## 하단의 행을 기준으로 출력하는 head()
## 하단부터 n번까지 출력하는 함수
df_2.tail(2)

  name  age          phone
1    B   30  010-0645-4534
2    C   40  010-2344-5677

In [28]:
## 컬럼을 기준으로 출력(시리즈 형태)
df_2["name"]

0    A
1    B
2    C
Name: name, dtype: object

In [29]:
## 컬럼을 기준으로 출력(데이터프레임 형태)
df_2[["name","age"]]

  name  age
0    A   20
1    B   30
2    C   40